burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_shrtimer.h
/*!
    \file    gd32e51x_shrtimer.h
    \brief   definitions for the SHRTIMER

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32E51X_SHRTIMER_H
#define GD32E51X_SHRTIMER_H

#include "gd32e51x.h"

/* SHRTIMERy(y=0) definitions */
#define SHRTIMER0                                     (SHRTIMER_BASE + 0x00000000U)

/* registers definitions */
/* Master_TIMER registers definitions */
#define SHRTIMER_MTCTL0(shrtimery)                     REG32((shrtimery) + 0x00000000U)             /*!< SHRTIMER Master_TIMER control register 0 */
#define SHRTIMER_MTINTF(shrtimery)                     REG32((shrtimery) + 0x00000004U)             /*!< SHRTIMER Master_TIMER interrupt flag register */
#define SHRTIMER_MTINTC(shrtimery)                     REG32((shrtimery) + 0x00000008U)             /*!< SHRTIMER Master_TIMER interrupt flag clear register */
#define SHRTIMER_MTDMAINTEN(shrtimery)                 REG32((shrtimery) + 0x0000000CU)             /*!< SHRTIMER Master_TIMER DMA and interrupt enable register */
#define SHRTIMER_MTCNT(shrtimery)                      REG32((shrtimery) + 0x00000010U)             /*!< SHRTIMER Master_TIMER counter register */
#define SHRTIMER_MTCAR(shrtimery)                      REG32((shrtimery) + 0x00000014U)             /*!< SHRTIMER Master_TIMER counter auto reload register */
#define SHRTIMER_MTCREP(shrtimery)                     REG32((shrtimery) + 0x00000018U)             /*!< SHRTIMER Master_TIMER counter repetition register */
#define SHRTIMER_MTCMP0V(shrtimery)                    REG32((shrtimery) + 0x0000001CU)             /*!< SHRTIMER Master_TIMER compare 0 value register */
#define SHRTIMER_MTCMP1V(shrtimery)                    REG32((shrtimery) + 0x00000024U)             /*!< SHRTIMER Master_TIMER compare 1 value register */
#define SHRTIMER_MTCMP2V(shrtimery)                    REG32((shrtimery) + 0x00000028U)             /*!< SHRTIMER Master_TIMER compare 2 value register */
#define SHRTIMER_MTCMP3V(shrtimery)                    REG32((shrtimery) + 0x0000002CU)             /*!< SHRTIMER Master_TIMER compare 3 value register */
#define SHRTIMER_MTACTL(shrtimery)                     REG32((shrtimery) + 0x0000007CU)             /*!< SHRTIMER Master_TIMER additional control register */

/* Slave_TIMERx(x=0..4) registers definitions */
#define SHRTIMER_STXCTL0(shrtimery, slavex)            REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000000U)          /*!< SHRTIMER Slave_TIMERx control register 0 */
#define SHRTIMER_STXINTF(shrtimery, slavex)            REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000004U)          /*!< SHRTIMER Slave_TIMERx interrupt flag register */
#define SHRTIMER_STXINTC(shrtimery, slavex)            REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000008U)          /*!< SHRTIMER Slave_TIMERx interrupt flag clear register */
#define SHRTIMER_STXDMAINTEN(shrtimery, slavex)        REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000000CU)          /*!< SHRTIMER Slave_TIMERx DMA and interrupt enable register */
#define SHRTIMER_STXCNT(shrtimery, slavex)             REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000010U)          /*!< SHRTIMER Slave_TIMERx counter register */
#define SHRTIMER_STXCAR(shrtimery, slavex)             REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000014U)          /*!< SHRTIMER Slave_TIMERx counter auto reload register */
#define SHRTIMER_STXCREP(shrtimery, slavex)            REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000018U)          /*!< SHRTIMER Slave_TIMERx counter repetition register */
#define SHRTIMER_STXCMP0V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000001CU)          /*!< SHRTIMER Slave_TIMERx compare 0 value register */
#define SHRTIMER_STXCMP0CP(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000020U)          /*!< SHRTIMER Slave_TIMERx compare 0 composite register */
#define SHRTIMER_STXCMP1V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000024U)          /*!< SHRTIMER Slave_TIMERx compare 1 value register */
#define SHRTIMER_STXCMP2V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000028U)          /*!< SHRTIMER Slave_TIMERx compare 2 value register */
#define SHRTIMER_STXCMP3V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000002CU)          /*!< SHRTIMER Slave_TIMERx compare 3 value register */
#define SHRTIMER_STXCAP0V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000030U)          /*!< SHRTIMER Slave_TIMERx capture 0 value register */
#define SHRTIMER_STXCAP1V(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000034U)          /*!< SHRTIMER Slave_TIMERx capture 1 value register */
#define SHRTIMER_STXDTCTL(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000038U)          /*!< SHRTIMER Slave_TIMERx dead-time control register */
#define SHRTIMER_STXCH0SET(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000003CU)          /*!< SHRTIMER Slave_TIMERx channel 0 set request register */
#define SHRTIMER_STXCH0RST(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000040U)          /*!< SHRTIMER Slave_TIMERx channel 0 reset request register */
#define SHRTIMER_STXCH1SET(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000044U)          /*!< SHRTIMER Slave_TIMERx channel 1 set request register */
#define SHRTIMER_STXCH1RST(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000048U)          /*!< SHRTIMER Slave_TIMERx channel 1 reset request register */
#define SHRTIMER_STXEXEVFCFG0(shrtimery, slavex)       REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000004CU)          /*!< SHRTIMER Slave_TIMERx external event filter configuration register 0 */
#define SHRTIMER_STXEXEVFCFG1(shrtimery, slavex)       REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000050U)          /*!< SHRTIMER Slave_TIMERx external event filter configuration register 1 */
#define SHRTIMER_STXCNTRST(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000054U)          /*!< SHRTIMER Slave_TIMERx counter reset register */
#define SHRTIMER_STXCSCTL(shrtimery, slavex)           REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000058U)          /*!< SHRTIMER Slave_TIMERx carrier-signal control register */
#define SHRTIMER_STXCAP0TRG(shrtimery, slavex)         REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000005CU)          /*!< SHRTIMER Slave_TIMERx capture 0 trigger register */
#define SHRTIMER_STXCAP1TRG(shrtimery, slavex)         REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000060U)          /*!< SHRTIMER Slave_TIMERx capture 1 trigger register */
#define SHRTIMER_STXCHOCTL(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000064U)          /*!< SHRTIMER Slave_TIMERx channel output control register */
#define SHRTIMER_STXFLTCTL(shrtimery, slavex)          REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x00000068U)          /*!< SHRTIMER Slave_TIMERx fault control register */
#define SHRTIMER_STXACTL(shrtimery, slavex)            REG32((shrtimery) + (((slavex) + 0x0001U) * 0x0080U) + 0x0000007CU)          /*!< SHRTIMER Slave_TIMERx additional control register */

