burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_shrtimer.h
/* common registers definitions */
#define SHRTIMER_CTL0(shrtimery)                       REG32(((shrtimery) + 0x00000380U) + 0x00000000U)            /*!< SHRTIMER control register 0 */
#define SHRTIMER_CTL1(shrtimery)                       REG32(((shrtimery) + 0x00000380U) + 0x00000004U)            /*!< SHRTIMER control register 1 */
#define SHRTIMER_INTF(shrtimery)                       REG32(((shrtimery) + 0x00000380U) + 0x00000008U)            /*!< SHRTIMER interrupt flag register */
#define SHRTIMER_INTC(shrtimery)                       REG32(((shrtimery) + 0x00000380U) + 0x0000000CU)            /*!< SHRTIMER interrupt flag clear register */
#define SHRTIMER_INTEN(shrtimery)                      REG32(((shrtimery) + 0x00000380U) + 0x00000010U)            /*!< SHRTIMER interrupt enable register */
#define SHRTIMER_CHOUTEN(shrtimery)                    REG32(((shrtimery) + 0x00000380U) + 0x00000014U)            /*!< SHRTIMER channel output enable register */
#define SHRTIMER_CHOUTDIS(shrtimery)                   REG32(((shrtimery) + 0x00000380U) + 0x00000018U)            /*!< SHRTIMER channel output disable register */
#define SHRTIMER_CHOUTDISF(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x0000001CU)            /*!< SHRTIMER channel output disable flag register */
#define SHRTIMER_BMCTL(shrtimery)                      REG32(((shrtimery) + 0x00000380U) + 0x00000020U)            /*!< SHRTIMER bunch mode control register */
#define SHRTIMER_BMSTRG(shrtimery)                     REG32(((shrtimery) + 0x00000380U) + 0x00000024U)            /*!< SHRTIMER bunch mode start trigger register */
#define SHRTIMER_BMCMPV(shrtimery)                     REG32(((shrtimery) + 0x00000380U) + 0x00000028U)            /*!< SHRTIMER bunch mode compare value register */
#define SHRTIMER_BMCAR(shrtimery)                      REG32(((shrtimery) + 0x00000380U) + 0x0000002CU)            /*!< SHRTIMER bunch mode counter auto reload register */
#define SHRTIMER_EXEVCFG0(shrtimery)                   REG32(((shrtimery) + 0x00000380U) + 0x00000030U)            /*!< SHRTIMER external event configuration register 0 */
#define SHRTIMER_EXEVCFG1(shrtimery)                   REG32(((shrtimery) + 0x00000380U) + 0x00000034U)            /*!< SHRTIMER external event configuration register 1 */
#define SHRTIMER_EXEVDFCTL(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000038U)            /*!< SHRTIMER external event digital filter control register */
#define SHRTIMER_ADCTRIGS0(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x0000003CU)            /*!< SHRTIMER trigger source 0 to ADC register */
#define SHRTIMER_ADCTRIGS1(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000040U)            /*!< SHRTIMER trigger source 1 to ADC register */
#define SHRTIMER_ADCTRIGS2(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000044U)            /*!< SHRTIMER trigger source 2 to ADC register */
#define SHRTIMER_ADCTRIGS3(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000048U)            /*!< SHRTIMER trigger source 3 to ADC register */
#define SHRTIMER_DLLCCTL(shrtimery)                    REG32(((shrtimery) + 0x00000380U) + 0x0000004CU)            /*!< SHRTIMER DLL calibration control register */
#define SHRTIMER_FLTINCFG0(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000050U)            /*!< SHRTIMER fault input configuration register 0 */
#define SHRTIMER_FLTINCFG1(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000054U)            /*!< SHRTIMER fault input configuration register 1 */
#define SHRTIMER_DMAUPMTR(shrtimery)                   REG32(((shrtimery) + 0x00000380U) + 0x00000058U)            /*!< SHRTIMER DMA update Master_TIMER register */
#define SHRTIMER_DMAUPST0R(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x0000005CU)            /*!< SHRTIMER DMA update Slave_TIMER0 register */
#define SHRTIMER_DMAUPST1R(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000060U)            /*!< SHRTIMER DMA update Slave_TIMER1 register */
#define SHRTIMER_DMAUPST2R(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000064U)            /*!< SHRTIMER DMA update Slave_TIMER2 register */
#define SHRTIMER_DMAUPST3R(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x00000068U)            /*!< SHRTIMER DMA update Slave_TIMER3 register */
#define SHRTIMER_DMAUPST4R(shrtimery)                  REG32(((shrtimery) + 0x00000380U) + 0x0000006CU)            /*!< SHRTIMER DMA update Slave_TIMER4 register */
#define SHRTIMER_DMATB(shrtimery)                      REG32(((shrtimery) + 0x00000380U) + 0x00000070U)            /*!< SHRTIMER DMA transfer buffer register */

/* bits definitions */
/* Master_TIMER registers */
/* SHRTIMER_MTCTL0 */
#define SHRTIMER_MTCTL0_CNTCKDIV2_0                      BITS(0,2)           /*!< counter clock division */
#define SHRTIMER_MTCTL0_CTNM                             BIT(3)              /*!< continuous mode */
#define SHRTIMER_MTCTL0_CNTRSTM                          BIT(4)              /*!< counter reset mode */
#define SHRTIMER_MTCTL0_HALFM                            BIT(5)              /*!< half mode */
#define SHRTIMER_MTCTL0_SYNISRC                          BITS(8,9)           /*!< synchronization input source */
#define SHRTIMER_MTCTL0_SYNIRST                          BIT(10)             /*!< synchronization input reset counter */
#define SHRTIMER_MTCTL0_SYNISTRT                         BIT(11)             /*!< synchronization input start counter */
#define SHRTIMER_MTCTL0_SYNOPLS                          BITS(12,13)         /*!< synchronization output pulse */
#define SHRTIMER_MTCTL0_SYNOSRC                          BITS(14,15)         /*!< synchronization output source */
#define SHRTIMER_MTCTL0_MTCEN                            BIT(16)             /*!< the counter of Master_TIMER enable */
#define SHRTIMER_MTCTL0_ST0CEN                           BIT(17)             /*!< the counter of Slave_TIMER0 enable */
#define SHRTIMER_MTCTL0_ST1CEN                           BIT(18)             /*!< the counter of Slave_TIMER1 enable */
#define SHRTIMER_MTCTL0_ST2CEN                           BIT(19)             /*!< the counter of Slave_TIMER2 enable */
#define SHRTIMER_MTCTL0_ST3CEN                           BIT(20)             /*!< the counter of Slave_TIMER3 enable */
#define SHRTIMER_MTCTL0_ST4CEN                           BIT(21)             /*!< the counter of Slave_TIMER4 enable */
#define SHRTIMER_MTCTL0_DACTRGS                          BITS(25,26)         /*!< trigger source to DAC */
#define SHRTIMER_MTCTL0_SHWEN                            BIT(27)             /*!< shadow registers enable */
#define SHRTIMER_MTCTL0_UPREP                            BIT(29)             /*!< update event generated by repetition event */
#define SHRTIMER_MTCTL0_UPSEL                            BITS(30,31)         /*!< update event selection */

/* SHRTIMER_MTINTF */
#define SHRTIMER_MTINTF_CMP0IF                           BIT(0)              /*!< compare 0 interrupt flag */
#define SHRTIMER_MTINTF_CMP1IF                           BIT(1)              /*!< compare 1 interrupt flag */
#define SHRTIMER_MTINTF_CMP2IF                           BIT(2)              /*!< compare 2 interrupt flag */
#define SHRTIMER_MTINTF_CMP3IF                           BIT(3)              /*!< compare 3 interrupt flag */
#define SHRTIMER_MTINTF_REPIF                            BIT(4)              /*!< repetition interrupt flag */
#define SHRTIMER_MTINTF_SYNIIF                           BIT(5)              /*!< synchronization input interrupt flag */
#define SHRTIMER_MTINTF_UPIF                             BIT(6)              /*!< update interrupt flag */

/* SHRTIMER_MTINTC */
#define SHRTIMER_MTINTC_CMP0IFC                          BIT(0)              /*!< clear compare 0 interrupt flag */
#define SHRTIMER_MTINTC_CMP1IFC                          BIT(1)              /*!< clear compare 1 interrupt flag */
#define SHRTIMER_MTINTC_CMP2IFC                          BIT(2)              /*!< clear compare 2 interrupt flag */
#define SHRTIMER_MTINTC_CMP3IFC                          BIT(3)              /*!< clear compare 3 interrupt flag */
#define SHRTIMER_MTINTC_REPIFC                           BIT(4)              /*!< clear repetition interrupt flag */
#define SHRTIMER_MTINTC_SYNIIFC                          BIT(5)              /*!< clear synchronization input interrupt flag */
#define SHRTIMER_MTINTC_UPIFC                            BIT(6)              /*!< clear update interrupt flag */

