burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_shrtimer.h
/* SHRTIMER_STxCH1RST */
#define SHRTIMER_STXCH1RST_CH1RSSEV                      BIT(0)              /*!< software event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSRST                      BIT(1)              /*!< Slave_TIMERx reset event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSPER                      BIT(2)              /*!< Slave_TIMERx period event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSCMP0                     BIT(3)              /*!< Slave_TIMERx compare 0 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSCMP1                     BIT(4)              /*!< Slave_TIMERx compare 1 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSCMP2                     BIT(5)              /*!< Slave_TIMERx compare 2 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSCMP3                     BIT(6)              /*!< Slave_TIMERx compare 3 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSMTPER                    BIT(7)              /*!< Master_TIMER period event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSMTCMP0                   BIT(8)              /*!< Master_TIMER compare 0 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSMTCMP1                   BIT(9)              /*!< Master_TIMER compare 1 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSMTCMP2                   BIT(10)             /*!< Master_TIMER compare 2 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSMTCMP3                   BIT(11)             /*!< Master_TIMER compare 3 event generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV0                    BIT(12)             /*!< Slave_TIMERx interconnection event 0 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV1                    BIT(13)             /*!< Slave_TIMERx interconnection event 1 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV2                    BIT(14)             /*!< Slave_TIMERx interconnection event 2 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV3                    BIT(15)             /*!< Slave_TIMERx interconnection event 3 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV4                    BIT(16)             /*!< Slave_TIMERx interconnection event 4 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV5                    BIT(17)             /*!< Slave_TIMERx interconnection event 5 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV6                    BIT(18)             /*!< Slave_TIMERx interconnection event 6 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV7                    BIT(19)             /*!< Slave_TIMERx interconnection event 7 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSSTEV8                    BIT(20)             /*!< Slave_TIMERx interconnection event 8 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV0                    BIT(21)             /*!< external event 0 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV1                    BIT(22)             /*!< external event 1 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV2                    BIT(23)             /*!< external event 2 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV3                    BIT(24)             /*!< external event 3 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV4                    BIT(25)             /*!< external event 4 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV5                    BIT(26)             /*!< external event 5 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV6                    BIT(27)             /*!< external event 6 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV7                    BIT(28)             /*!< external event 7 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV8                    BIT(29)             /*!< external event 8 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSEXEV9                    BIT(30)             /*!< external event 9 generates channel 1 ��reset request�� */
#define SHRTIMER_STXCH1RST_CH1RSUP                       BIT(31)             /*!< update event generates channel 1 ��reset request�� */

/* SHRTIMER_STxEXEVFCFG0 */
#define SHRTIMER_STXEXEVFCFG0_EXEV0MEEN                  BIT(0)              /*!< external event 0 memory */
#define SHRTIMER_STXEXEVFCFG0_EXEV0FM                    BITS(1,4)           /*!< external event 0 filter mode */
#define SHRTIMER_STXEXEVFCFG0_EXEV1MEEN                  BIT(6)              /*!< external event 1 memory */
#define SHRTIMER_STXEXEVFCFG0_EXEV1FM                    BITS(7,10)          /*!< external event 1 filter mode */
#define SHRTIMER_STXEXEVFCFG0_EXEV2MEEN                  BIT(12)             /*!< external event 2 memory */
#define SHRTIMER_STXEXEVFCFG0_EXEV2FM                    BITS(13,16)         /*!< external event 2 filter mode */
#define SHRTIMER_STXEXEVFCFG0_EXEV3MEEN                  BIT(18)             /*!< external event 3 memory */
#define SHRTIMER_STXEXEVFCFG0_EXEV3FM                    BITS(19,22)         /*!< external event 3 filter mode */
#define SHRTIMER_STXEXEVFCFG0_EXEV4MEEN                  BIT(24)             /*!< external event 4 memory */
#define SHRTIMER_STXEXEVFCFG0_EXEV4FM                    BITS(25,28)         /*!< external event 4 filter mode */

/* SHRTIMER_STxEXEVFCFG1 */
#define SHRTIMER_STXEXEVFCFG1_EXEV5MEEN                  BIT(0)              /*!< external event 5 memory */
#define SHRTIMER_STXEXEVFCFG1_EXEV5FM                    BITS(1,4)           /*!< external event 5 filter mode */
#define SHRTIMER_STXEXEVFCFG1_EXEV6MEEN                  BIT(6)              /*!< external event 6 memory */
#define SHRTIMER_STXEXEVFCFG1_EXEV6FM                    BITS(7,10)          /*!< external event 6 filter mode */
#define SHRTIMER_STXEXEVFCFG1_EXEV7MEEN                  BIT(12)             /*!< external event 7 memory */
#define SHRTIMER_STXEXEVFCFG1_EXEV7FM                    BITS(13,16)         /*!< external event 7 filter mode */
#define SHRTIMER_STXEXEVFCFG1_EXEV8MEEN                  BIT(18)             /*!< external event 8 memory */
#define SHRTIMER_STXEXEVFCFG1_EXEV8FM                    BITS(19,22)         /*!< external event 8 filter mode */
#define SHRTIMER_STXEXEVFCFG1_EXEV9MEEN                  BIT(24)             /*!< external event 9 memory */
#define SHRTIMER_STXEXEVFCFG1_EXEV9FM                    BITS(25,28)         /*!< external event 9 filter mode */

