burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_shrtimer.h
/* the event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_NONE                  ((uint32_t)0x00000000U)                                 /*!< clear all triggers */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTRESET               (SHRTIMER_BMSTRG_MTRST)                                  /*!< Master_TIMER reset event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTREPETITION          (SHRTIMER_BMSTRG_MTREP)                                  /*!< Master_TIMER repetition event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTCMP0                (SHRTIMER_BMSTRG_MTCMP0)                                 /*!< Master_TIMER compare 0 event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTCMP1                (SHRTIMER_BMSTRG_MTCMP1)                                 /*!< Master_TIMER compare 1 event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTCMP2                (SHRTIMER_BMSTRG_MTCMP2)                                 /*!< Master_TIMER compare 2 event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_MTCMP3                (SHRTIMER_BMSTRG_MTCMP3)                                 /*!< Master_TIMER compare 3 event triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST0RESET              (SHRTIMER_BMSTRG_ST0RST)                                 /*!< Slave_TIMER0 reset event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST0REPETITION         (SHRTIMER_BMSTRG_ST0REP)                                 /*!< Slave_TIMER0 repetition event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST0CMP0               (SHRTIMER_BMSTRG_ST0CMP0)                                /*!< Slave_TIMER0 compare 0 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST0CMP1               (SHRTIMER_BMSTRG_ST0CMP1)                                /*!< Slave_TIMER0 compare 1 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST1RESET              (SHRTIMER_BMSTRG_ST1RST)                                 /*!< Slave_TIMER1 reset event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST1REPETITION         (SHRTIMER_BMSTRG_ST1REP)                                 /*!< Slave_TIMER1 repetition event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST1CMP0               (SHRTIMER_BMSTRG_ST1CMP0)                                /*!< Slave_TIMER1 compare 0 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST1CMP1               (SHRTIMER_BMSTRG_ST1CMP1)                                /*!< Slave_TIMER1 compare 1 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST2RESET              (SHRTIMER_BMSTRG_ST2RST)                                 /*!< Slave_TIMER2 reset event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST2REPETITION         (SHRTIMER_BMSTRG_ST2REP)                                 /*!< Slave_TIMER2 repetition event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST2CMP0               (SHRTIMER_BMSTRG_ST2CMP0)                                /*!< Slave_TIMER2 compare 0 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST2CMP1               (SHRTIMER_BMSTRG_ST2CMP1)                                /*!< Slave_TIMER2 compare 1 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST3RESET              (SHRTIMER_BMSTRG_ST3RST)                                 /*!< Slave_TIMER3 reset event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST3REPETITION         (SHRTIMER_BMSTRG_ST3REP)                                 /*!< Slave_TIMER3 repetition event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST3CMP0               (SHRTIMER_BMSTRG_ST3CMP0)                                /*!< Slave_TIMER3 compare 0 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST3CMP1               (SHRTIMER_BMSTRG_ST3CMP1)                                /*!< Slave_TIMER3 compare 1 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST4RESET              (SHRTIMER_BMSTRG_ST4RST)                                 /*!< Slave_TIMER4 reset event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST4REPETITION         (SHRTIMER_BMSTRG_ST4REP)                                 /*!< Slave_TIMER4 repetition event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST4CMP0               (SHRTIMER_BMSTRG_ST4CMP0)                                /*!< Slave_TIMER4 compare 0 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST4CMP1               (SHRTIMER_BMSTRG_ST4CMP1)                                /*!< Slave_TIMER4 compare 1 event triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST0EVENT6             (SHRTIMER_BMSTRG_ST0EXEV6)                               /*!< Slave_TIMER0 period event following external event 6 triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_ST3EVENT7             (SHRTIMER_BMSTRG_ST3EXEV7)                               /*!< Slave_TIMER3 period event following external event 7 triggers bunch mode operation  */
#define SHRTIMER_BUNCHMODE_TRIGGER_EVENT6                (SHRTIMER_BMSTRG_EXEV6)                                  /*!< external event 6 triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_EVENT7                (SHRTIMER_BMSTRG_EXEV7)                                  /*!< external event 7 triggers bunch mode operation */
#define SHRTIMER_BUNCHMODE_TRIGGER_CHIP                  (SHRTIMER_BMSTRG_CISGN)                                  /*!< chip internal signal triggers bunch mode operation */

/* external event source */
#define SHRTIMER_EXEV_SRC0                               ((uint32_t)0x00000000U)                                 /*!< external event y source is EXEVySRC 0 */
#define SHRTIMER_EXEV_SRC1                               ((uint32_t)0x00000001U)                                 /*!< external event y source is EXEVySRC 1 */
#define SHRTIMER_EXEV_SRC2                               ((uint32_t)0x00000002U)                                 /*!< external event y source is EXEVySRC 2 */
#define SHRTIMER_EXEV_SRC3                               ((uint32_t)0x00000003U)                                 /*!< external event y source is EXEVySRC 3 */

